https://en.m.wikibooks.org/wiki/SQL_Exercises/The_computer_store

In [ ]:
%load_ext sql
%sql sqlite:///db.db3

In [ ]:
%%sql sqlite://
 
CREATE TABLE Manufacturers (
    Code INTEGER PRIMARY KEY NOT NULL,
    Name CHAR(50) NOT NULL 
);
 
CREATE TABLE Products (
    Code INTEGER PRIMARY KEY NOT NULL,
    Name CHAR(50) NOT NULL ,
    Price REAL NOT NULL ,
    Manufacturer INTEGER NOT NULL 
        CONSTRAINT fk_Manufacturers_Code REFERENCES Manufacturers(Code)
);

INSERT INTO Manufacturers(Code,Name) VALUES(1,'Sony');
INSERT INTO Manufacturers(Code,Name) VALUES(2,'Creative Labs');
INSERT INTO Manufacturers(Code,Name) VALUES(3,'Hewlett-Packard');
INSERT INTO Manufacturers(Code,Name) VALUES(4,'Iomega');
INSERT INTO Manufacturers(Code,Name) VALUES(5,'Fujitsu');
INSERT INTO Manufacturers(Code,Name) VALUES(6,'Winchester');
 
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(1,'Hard drive',240,5);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(2,'Memory',120,6);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(3,'ZIP drive',150,4);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(4,'Floppy disk',5,6);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(5,'Monitor',240,1);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(6,'DVD drive',180,2);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(7,'CD drive',90,2);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(8,'Printer',270,3);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(9,'Toner cartridge',66,3);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(10,'DVD burner',180,2);

In [ ]:
# 1. Select the names of all the products in the store.
%sql select name from products;

In [ ]:
# 2. Select the names and the prices of all the products in the store.
%sql select name, price from products;

In [ ]:
# 3. Select the name of the products with a price less than or equal to $200.
%sql select name from products where price <= 200;

In [ ]:
# 4. Select all the products with a price between $60 and $120.
%sql select name from products where price between 60 and 120;

In [ ]:
# 5. Select the name and price in cents (i.e., the price must be multiplied by 100).
%sql select name, price*100 as cents from products;

In [ ]:
# 6. Compute the average price of all the products.
%sql select avg(price) from products;

In [ ]:
# 7. Compute the average price of all products with manufacturer code equal to 2.
%sql select avg(price) from products where manufacturer = 2;

In [ ]:
# 8. Compute the number of products with a price larger than or equal to $180.
%sql select count(*) from products where price >= 180;

In [ ]:
# 9. Select the name and price of all products with a price larger than or equal to $180, and sort first by price (in descending order), and then by name (in ascending order).
%sql select name, price from products where price >= 180 order by price desc, name;

In [ ]:
# 10. Select all the data from the products, including all the data for each product's manufacturer.
%sql select * from products inner join manufacturers on products.manufacturer = manufacturers.code;

In [ ]:
# 11. Select the product name, price, and manufacturer name of all the products.
%sql select p.name, p.price, m.name from products as p inner join manufacturers as m on p.manufacturer = m.code;

In [ ]:
# 12. Select the average price of each manufacturer's products, showing only the manufacturer's code.
%sql select manufacturer, avg(price) from products group by manufacturer;

In [ ]:
# 13. Select the average price of each manufacturer's products, showing the manufacturer's name.
%sql select m.name, avg(p.price) from products as p, manufacturers as m where p.manufacturer = m.code group by m.name;

In [ ]:
%sql select m.name, avg(p.price) from products as p inner join manufacturers as m on p.manufacturer = m.code group by m.name;

In [ ]:
# 14. Select the names of manufacturer whose products have an average price larger than or equal to $150.
%sql select m.name, avg(p.price) from products as p inner join manufacturers as m on p.manufacturer = m.code group by m.name having avg(p.price) >= 150;

In [ ]:
# 15. Select the name and price of the cheapest product.
%sql select name, price from products where price = (select min(price) from products);

In [ ]:
%sql select name, price from products order by price asc limit 1;

In [ ]:
# 16. Select the name of each manufacturer along with the name and price of its most expensive product.
%sql select distinct m.name, p.price from products as p inner join manufacturers as m on p.manufacturer = m.code and p.price = (select max(price) from products where products.manufacturer = m.code) order by m.name;

In [ ]:
%sql select name, (select max(price) from products where products.manufacturer = manufacturers.code) as max_price from manufacturers order by name;

In [ ]:
%sql select m.name, max(p.price) from products as p inner join manufacturers as m on p.manufacturer = m.code group by m.code order by m.name;

In [ ]:
# 17. Select the name of each manufacturer which have an average price above $145 and contain at least 2 different products.
%sql select m.name, avg(p.price), count(*) from products as p inner join manufacturers as m on p.manufacturer = m.code group by m.name having avg(p.price) >= 145 and count(*) >= 2;

In [ ]:
# 18. Add a new product: Loudspeakers, $70, manufacturer 2.
%sql insert into products (name, price, manufacturer) values ('Loudspeakers', 70, 2);

In [ ]:
# 19. Update the name of product 8 to "Laser Printer".
%sql update products set name = 'Laser Printer' where code = 8;

In [ ]:
# 20. Apply a 10% discount to all products.
%sql update products set price = price * 0.9;

In [ ]:
# 21. Apply a 10% discount to all products with a price larger than or equal to $120.
%sql update products set price = price * 0.9 where price >= 120;